---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateDouble(System.Double)
source: html/814c7950-3f73-a203-3c8a-923fdedb344f.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateDouble Method

Creates a double data object.

## Syntax (C#)
```csharp
public static IFCData CreateDouble(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The double value.

## Returns
The IFCData object.